app/Http/Controllers/AspirasiController.php

    function index()  {
        $aspirasis = Aspirasi::with('aspirasis_category')->paginate(4);
        $categories = AspirasiCategory::latest()->get();
---
select * from `aspirasis` limit 4 offset 0
select count(*) as aggregate from `aspirasis`
select * from `aspirasi_categories` order by `created_at` desc

    function store(Request $request) {
        $request->validate([
            'nama_mahasiswa' => 'required|min:3|max:255',
            'aspirasis_category_id' => 'required|exists:aspirasi_categories,id',
            'judul' => 'required|min:5|max:255|regex:/^[a-zA-Z0-9\s]+$/',
            'aspirasi' => 'required|min:10|regex:/^[a-zA-Z0-9\s]+$/|max:1000',
        ], [
            'aspirasis_category_id.exists' => 'Kategori aspirasi tidak ada!',
            'aspirasis_category_id.required' => 'Kategori aspirasi harus dipilih!',
            'nama_mahasiswa.required' => 'Nama harus diisi!',
            'judul.required' => 'Judul Aspirasi harus diisi!',
            'aspirasi.required' => 'Isi Aspirasi harus diisi!',
        ]);

        Aspirasi::create([
            'nama_mahasiswa' => $request->nama_mahasiswa,
            'aspirasis_category_id' => $request->aspirasis_category_id,
            'judul' => $request->judul,
            'aspirasi' => $request->aspirasi,
            'telepon' => $request->telepon,
            'is_anonimous' => $request->has('is_anonimous') ? true : false,
        ]);
---
insert into `aspirasis` (`nama_mahasiswa`, `aspirasis_category_id`, `judul`, `aspirasi`, `telepon`, `is_anonimous`, `updated_at`, `created_at`) values ('Hamzan Wahyudi', '2', 'Fasilitas kampus kurang memadai', 'Fasilitas kampus tidak memadai untuk kegiatan ajar mengajar dan praktikum mahasiswa informatika', '087126737123', 0, '2024-07-18 12:10:10', '2024-07-18 12:10:10')