app/Filament/Resources/ArtikelResource.php

    public static function form(Form $form): Form
    {
        return $form
            ->schema([
                Section::make('Informasi Artikel')->schema([
                    Hidden::make('user_id')
                        ->default(auth()->id()),
                    TextInput::make('judul')
                        ->required()
                        ->maxLength(255)
                        ->live(onBlur: true)
                        ->afterStateUpdated(function (Set $set, $state) {
                            $set('slug', Str::slug($state));
                        }),
                    Hidden::make('slug')
                        ->required(),
                    RichEditor::make('konten'),
                ]),

                Section::make('Informasi Tambahan')->schema([
                    FileUpload::make('gambar')
                        ->image()
                        ->imagePreviewHeight(200)
                        ->label('Gambar'),
                    Select::make('category_id')
                        ->relationship('category', 'category')
                        ->options(fn () => \App\Models\Category::pluck('category', 'id'))
                        ->label('Kategori')
---
select `category`, `id` from `categories`