app/Models/Artikel.php

    public static function getNLatest($n = 10)
    {
        return self::where('is_published', 1)
            ->latest('published_at')
            ->take($n)
            ->get(['id', 'judul', 'published_at', 'category_id', 'user_id']);
---
select `id`, `judul`, `published_at`, `category_id`, `user_id` from `artikels` where `is_published` = 1 order by `published_at` desc limit 5

    public static function getAllByUser(int $userId, int $limit = 10): \Illuminate\Pagination\LengthAwarePaginator
    {
        return self::with(['category', 'user'])
            ->latest()
            ->whereUserId($userId)
            ->paginate($limit);
---
select `id`, `category` from `categories` where `categories`.`id` in (1, 3)

    public static function getOtherArticles(String|int $id, int $limit = 5, $latest = false)
    {
        return self::select('id', 'judul', 'published_at', 'category_id', 'user_id')
            ->with(['category:id,category', 'user:id,name'])
            ->where('id', '!=', $id)
            ->when($latest, function ($query) {
                return $query->latest();
            })
            ->limit($limit)
            ->get([
                'articles.id', 'articles.judul', 'articles.published_at',
                'articles.category_id', 'articles.user_id',
                'categories.category', 'users.name'
            ]);
---
select `id`, `judul`, `published_at`, `category_id`, `user_id` from `artikels` where `id` != '3' order by `created_at` desc limit 5
select `id`, `name` from `users` where `users`.`id` in (1)
select `id`, `category` from `categories` where `categories`.`id` in (1)
select `id`, `judul`, `published_at`, `category_id`, `user_id` from `artikels` where `id` != '2' order by `created_at` desc limit 5

    public static function findWithRelationById(String|int $id): self
    {
        return self::where('is_published', 1)->with(['category:id,category', 'user:id,name'])
            ->findOrFail($id);
---
select * from `artikels` where `is_published` = 1 and `artikels`.`id` = '2' limit 1
select `id`, `category` from `categories` where `categories`.`id` in (3)
select `id`, `name` from `users` where `users`.`id` in (1)